void hinto() {
  switch(stage) {
  case 0:
    egg(450, 900, 0.6, false);
    freeText("ゴブリンは","溜めてハーするだけ。",110,390,30);
    freeText("ハーのタイミングで","しっかり守ろう",110,490,30);
    break;
  case 1:
    egg(450, 900, 0.6, false);
    freeText("スライムは","しっかり守ってくる。",110,390,30);
    freeText("隙を","見極めよう",110,490,30);
    break;
  case 2:
    egg(450, 900, 0.6, false);
    freeText("パンダは正直。","言ってることに",110,390,30);
    freeText("耳を澄ましてみよう。","",110,490,30);
    break;
  case 3:
    egg(450, 900, 0.6, false);
    freeText("ウィッチは嘘つき。","騙されずに",110,390,30);
    freeText("隙を見極めて","ハー!しよう",110,490,30);
    break;
  case 4:
    egg(450, 900, 0.6, false);
    freeText("なまけものは...","zzz....",110,390,30);
    freeText("スヤァ...",".....",110,490,30);
    break;
  case 5:
    egg(450, 900, 0.6, false);
    freeText("ドクキノコズは二匹。","二匹共の隙があるはず。",110,390,30);
    freeText("そのタイミングを","狙ってハー!しよう",110,490,30);
    break;
  case 6:
    egg(450, 900, 0.6, false);
    freeText("バードは動きが複雑。","2回溜めさせると",110,390,30);
    freeText("凶悪だから","早めに倒そう。",110,490,30);
    break;
  case 7:
    egg(450, 900, 0.6, false);
    freeText("敵が見えない!!?","でもバグじゃないよ。",110,390,30);  
    freeText("大きな爆発があったら","見えるかもしれないね。",110,490,30);
    break;
  case 8:
    egg(450, 900, 0.6, false);
    freeText("宇宙人はハー!が","最初からできる。",110,390,30);
    freeText("でも打てる数は有限。","力尽きるまで守ろう。",110,490,30);
    break;
  case 9:
    egg(450, 900, 0.6, true);
    freeText("勇者はハー!が無制限。","動きもパターンがない。",110,390,30);
    freeText("僕から言えるのは一言。","頑張って。",110,490,30);
    break;
  }
}
